class Machine:
    def __init__(self, id):
        # กำหนดคุณสมบัติของเครื่องรีดนม เช่น ID, วัวที่กำลังรีดนม, สถานะของหัวรีดนม
        self.id = id  # รหัสประจำตัวของเครื่องรีดนม
        self.current_cow = None  # วัวที่กำลังรีดนมในปัจจุบัน (เริ่มต้นเป็น None เพราะยังไม่มีวัว)
        self.milking_heads = ["idle"] * 4  # หัวรีดนมทั้ง 4 เต้าจะอยู่ในสถานะ idle เมื่อยังไม่ได้ใช้งาน
        
    # ฟังก์ชันสำหรับรีเซ็ตเครื่องให้กลับสู่สถานะเริ่มต้น
    def reset(self):
        self.current_cow = None  # รีเซ็ตวัวปัจจุบันให้เป็น None
        self.milking_heads = ["idle"] * 4  # รีเซ็ตหัวรีดนมทั้ง 4 ให้กลับไปเป็น idle
    
    # ฟังก์ชันสำหรับแสดงข้อมูลเครื่องในรูปแบบ string
    def __str__(self) -> str:
        return f"Machine {self.id}"  # แสดงรหัสเครื่องรีดนม
